Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_route_table.test-public-rt-01 will be created
+ resource "aws_route_table" "test-public-rt-01" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0dbd44ae6ebcdbc08"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "test-pub-rt-01"
        }
      + tags_all         = {
          + "Name" = "test-pub-rt-01"
        }
      + vpc_id           = "vpc-07c351726dbf60596"
    }

  # aws_route_table_association.test-public-01 will be created
+ resource "aws_route_table_association" "test-public-01" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-030e3ff34aaca1992"
    }

  # aws_route_table_association.test-public-02 will be created
+ resource "aws_route_table_association" "test-public-02" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-03b8b477519e18ac2"
    }

  # aws_vpc.test-vpc-01 will be updated in-place
~ resource "aws_vpc" "test-vpc-01" {
        id                                   = "vpc-07c351726dbf60596"
      ~ tags                                 = {
          ~ "Name" = "test-vpc-0156" -> "test-vpc-01234"
        }
      ~ tags_all                             = {
          ~ "Name" = "test-vpc-0156" -> "test-vpc-01234"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://13.228.75.65:4141/lock?id=bds-hanhvu%252Fhanhvd-aws-lab%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 3 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`